app/views/dashboard/index.html.erb

SELECT COUNT(*) FROM "bins" WHERE "bins"."user_id" = 1
---
                  </div>
                  <h3 class="h4 mb-1"><%= current_user.bins.count %></h3>