app/controllers/dashboard_controller.rb

SELECT COUNT(*) FROM "bins" WHERE "bins"."user_id" = 1
---
  def index
    @user = current_user
    @bins_counts = @user.bins.count