app/controllers/items_controller.rb

  def index
    if params[:location_id]
      @items = current_user.items.where(location_id: params[:location_id])
    else
      @items = current_user.items # Show only bins for the logged-in user
    end

    # Filter by created_at if sale_date is provided
    if params[:sale_date].present?
      @items = @items.where("created_at <= ?", params[:sale_date])
---
SELECT "items".* FROM "items" INNER JOIN "bins" ON "bins"."id" = "items"."bin_id" WHERE "bins"."user_id" = 1

  def show
    # list all possible bins for the item
    @bins = Bin.where(user_id: current_user.id)
---
SELECT "bins".* FROM "bins" WHERE "bins"."user_id" = 1 AND "bins"."id" = 12 LIMIT 1

  def create
    @item = current_user.items.build(item_params)

    # Set no_bin to true if no bin is selected
    @item.no_bin = @item.bin_id.nil?

     # Set the item's location:
    if @item.bin_id.present?
---
SELECT "bins".* FROM "bins" WHERE "bins"."user_id" = 1 AND "bins"."id" = 12 LIMIT 1