app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'khush@gmail.com' LIMIT 1
---
  def create
    #puts params.inspect
    user = User.find_by(email: params[:user][:email]) # Ensure correct parameter format