app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "name", "email", "password_digest", "bins_count") VALUES ('2025-02-15 20:43:48.865587', '2025-02-15 20:43:48.865587', 'Khush', 'khush@gmail.com', '$2a$12$ZwIlGrBFXqnciVsjnPeZIuihVo/9G3Jr3L9yxGqeNrariTZOwecEO', 0) RETURNING "id"